In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
df=DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.4]],
            index=['a','b','c','d'],
            columns=['1','2'])

In [3]:
df

      1    2
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.4

In [5]:
df.idxmax()

1    b
2    d
dtype: object

In [6]:
df1=DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,1],[0.75,-1.4]],
            index=['a','b','c','d'],
            columns=['1','2'])

In [7]:
df1.idxmax()

1    b
2    c
dtype: object

In [10]:
df.sum()

1    9.25
2   -5.90
dtype: float64

In [11]:
df.sum(axis=0)

1    9.25
2   -5.90
dtype: float64

In [12]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.65
dtype: float64

In [13]:
# skinpa : 누락된 값을 제외할 것인 정하는 옵션

df.mean(axis=1,skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.325
dtype: float64

In [14]:
df.cumsum() #누적으로 더해짐

      1    2
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.9

In [15]:
df.describe()    #R에서의 summary()와 비슷

              1         2
count  3.000000  2.000000
mean   3.083333 -2.950000
std    3.493685  2.192031
min    0.750000 -4.500000
25%    1.075000 -3.725000
50%    1.400000 -2.950000
75%    4.250000 -2.175000
max    7.100000 -1.400000

In [16]:
df

      1    2
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.4

In [17]:
a=Series(['a','a','b','c']*4)

In [18]:
a.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [19]:
a

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [20]:
uniques=a.unique()

In [21]:
uniques

array(['a', 'b', 'c'], dtype=object)

In [22]:
a.value_counts()  #중복된 값 계산

a    8
b    4
c    4
dtype: int64

In [39]:
pd.value_counts(a.values,sort=False)  #내름차순이 아닌 아무거나

c    4
b    4
a    8
dtype: int64

In [24]:
pd.value_counts(a.values,sort=True) #내름차순

a    8
b    4
c    4
dtype: int64

In [27]:
mask=a.isin(['b'])
mask

0     False
1     False
2      True
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10     True
11    False
12    False
13    False
14     True
15    False
dtype: bool

In [29]:
a[mask]

2     b
6     b
10    b
14    b
dtype: object

In [31]:
data=DataFrame({'Q1':[1,3,4,3,4],'Q2':[2,3,1,2,3],'Q3':[1,5,4,2,2]})
data

   Q1  Q2  Q3
0   1   2   1
1   3   3   5
2   4   1   4
3   3   2   2
4   4   3   2

In [33]:
result=data.apply(pd.value_counts).fillna(0)  #Q1에서 요소의 개수
#result=data.apply(pd.value_counts).fillna(X)  X를 값이 없는 부분에 입력
result

    Q1   Q2   Q3
1  1.0  1.0  1.0
2  0.0  2.0  2.0
3  2.0  2.0  0.0
4  2.0  0.0  1.0
5  0.0  0.0  1.0

In [36]:
result=data.apply(pd.value_counts).fillna(1)  
result

    Q1   Q2   Q3
1  1.0  1.0  1.0
2  1.0  2.0  2.0
3  2.0  2.0  1.0
4  2.0  1.0  1.0
5  1.0  1.0  1.0

In [38]:
result=data.apply(pd.value_counts).fillna(np.nan)  
result

    Q1   Q2   Q3
1  1.0  1.0  1.0
2  NaN  2.0  2.0
3  2.0  2.0  NaN
4  2.0  NaN  1.0
5  NaN  NaN  1.0

In [40]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.581569 -0.368142  0.671844  0.360510
1  0.792460  0.934812  1.439011 -0.591135
2  0.099158  1.224226 -1.766536  0.716777
3  0.830635  0.147217 -0.975936  2.108346
4 -1.410168 -0.408668 -3.794911 -0.066276
5  0.304484 -0.332366 -1.543150 -0.653392
6 -0.890992 -1.343139 -0.703232 -0.701415
7 -0.432447  0.780792 -0.488917 -0.875346
8 -0.653958  0.318780  0.676521 -1.263336
9 -0.772509  0.295958  1.505070 -0.986323

In [41]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0  1.581569 -0.368142  0.671844  0.360510
1  0.792460  0.934812  1.439011 -0.591135
2  0.099158  1.224226 -1.766536  0.716777
3  0.830635  0.147217 -0.975936  2.108346
4 -1.410168 -0.408668 -3.794911 -0.066276
5  0.304484 -0.332366 -1.543150 -0.653392
6 -0.890992 -1.343139 -0.703232 -0.701415
7 -0.432447  0.780792 -0.488917 -0.875346
8 -0.653958  0.318780  0.676521 -1.263336
9 -0.772509  0.295958  1.505070 -0.986323

In [43]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [44]:
right

   key  rval
0  foo     4
1  foo     5

In [45]:
pd.merge(left, right, on='key')  #경우의 수 생각

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [46]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

left

   key  lval
0  foo     1
1  bar     2

In [47]:
right

   key  rval
0  foo     4
1  bar     5

In [48]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [49]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -0.770116  0.688803 -0.511056 -0.448286
1  0.176071  0.359479 -0.399242  1.822490
2  0.992482  1.910538 -1.244177  0.192765
3  0.458667 -1.196885 -1.207100  0.343048
4 -0.355238 -1.094070  0.187077 -0.931061
5  0.807561  0.828851  1.466130  0.019574
6  0.102642  1.936028  0.270967  0.271532
7 -0.832226  0.521713 -2.543056 -0.922627

In [51]:
 s = df.iloc[3]
s

A    0.458667
B   -1.196885
C   -1.207100
D    0.343048
Name: 3, dtype: float64

In [52]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.770116  0.688803 -0.511056 -0.448286
1  0.176071  0.359479 -0.399242  1.822490
2  0.992482  1.910538 -1.244177  0.192765
3  0.458667 -1.196885 -1.207100  0.343048
4 -0.355238 -1.094070  0.187077 -0.931061
5  0.807561  0.828851  1.466130  0.019574
6  0.102642  1.936028  0.270967  0.271532
7 -0.832226  0.521713 -2.543056 -0.922627
8  0.458667 -1.196885 -1.207100  0.343048

In [53]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [54]:
string_data.isnull()  #논리형찾기

0    False
1    False
2     True
3    False
dtype: bool

In [55]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [56]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [58]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [59]:
cleaned = data.dropna()   #non값이 모두 없는경우만 뽑기 
cleaned

     0    1    2
0  1.0  6.5  3.0

In [60]:
# 모든 값이 NA인 로우만 제외
data.dropna(how='all')  #non값이 모두 없는경우만 빼고 뽑기

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [64]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [61]:
data.dropna(axis=0, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [62]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [66]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [67]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [68]:
df = DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.010412  0.571118  0.430536
1 -0.774388  0.409862  0.372945
2 -1.952644 -1.462801  0.582932
3  0.944269  1.440195 -0.142721
4 -0.082794 -1.811112 -0.576997
5 -1.785467 -0.011674 -0.881664
6  0.957401  0.011972 -1.259482

In [69]:
df.iloc[:4, 1] = NA 
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.010412       NaN       NaN
1 -0.774388       NaN       NaN
2 -1.952644       NaN  0.582932
3  0.944269       NaN -0.142721
4 -0.082794 -1.811112 -0.576997
5 -1.785467 -0.011674 -0.881664
6  0.957401  0.011972 -1.259482

In [70]:
# thresh : 몇 개 이상의 값이 들어있는 로우만 살펴보고 싶을때 넣는 인자 값
df.dropna(thresh=3)

          0         1         2
4 -0.082794 -1.811112 -0.576997
5 -1.785467 -0.011674 -0.881664
6  0.957401  0.011972 -1.259482

In [71]:
df.dropna(thresh=2)

          0         1         2
2 -1.952644       NaN  0.582932
3  0.944269       NaN -0.142721
4 -0.082794 -1.811112 -0.576997
5 -1.785467 -0.011674 -0.881664
6  0.957401  0.011972 -1.259482

In [72]:
df

          0         1         2
0 -0.010412       NaN       NaN
1 -0.774388       NaN       NaN
2 -1.952644       NaN  0.582932
3  0.944269       NaN -0.142721
4 -0.082794 -1.811112 -0.576997
5 -1.785467 -0.011674 -0.881664
6  0.957401  0.011972 -1.259482

In [73]:
df.fillna(0)

          0         1         2
0 -0.010412  0.000000  0.000000
1 -0.774388  0.000000  0.000000
2 -1.952644  0.000000  0.582932
3  0.944269  0.000000 -0.142721
4 -0.082794 -1.811112 -0.576997
5 -1.785467 -0.011674 -0.881664
6  0.957401  0.011972 -1.259482

In [74]:
# fillna에 사전값을 넣어서 각 칼럼마다 다른값을 채워넣을수도 있다.
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.010412  0.500000       NaN
1 -0.774388  0.500000       NaN
2 -1.952644  0.500000  0.582932
3  0.944269  0.500000 -0.142721
4 -0.082794 -1.811112 -0.576997
5 -1.785467 -0.011674 -0.881664
6  0.957401  0.011972 -1.259482

In [75]:
# fillna에 사전값을 넣어서 각 칼럼마다 다른값을 채워넣을수도 있다.
df.fillna({1: 0.5, 2: -1})

          0         1         2
0 -0.010412  0.500000 -1.000000
1 -0.774388  0.500000 -1.000000
2 -1.952644  0.500000  0.582932
3  0.944269  0.500000 -0.142721
4 -0.082794 -1.811112 -0.576997
5 -1.785467 -0.011674 -0.881664
6  0.957401  0.011972 -1.259482

In [76]:
# fillna는 값을 채워 넣은 객체의 참조를 반환한다.
_ = df.fillna(0, inplace=True)  #데이터 자체가 바뀜
df

          0         1         2
0 -0.010412  0.000000  0.000000
1 -0.774388  0.000000  0.000000
2 -1.952644  0.000000  0.582932
3  0.944269  0.000000 -0.142721
4 -0.082794 -1.811112 -0.576997
5 -1.785467 -0.011674 -0.881664
6  0.957401  0.011972 -1.259482

In [77]:
df = DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA 
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.402119  0.542518  0.625636
1  0.955001  0.996203 -1.000390
2  0.294564       NaN -0.285961
3  1.439301       NaN  1.316858
4  0.421212       NaN       NaN
5 -1.427397       NaN       NaN

In [78]:
df.fillna(method='ffill')  #바로 위의 값으로 채워줌

          0         1         2
0  0.402119  0.542518  0.625636
1  0.955001  0.996203 -1.000390
2  0.294564  0.996203 -0.285961
3  1.439301  0.996203  1.316858
4  0.421212  0.996203  1.316858
5 -1.427397  0.996203  1.316858

In [81]:
df.fillna(method='ffill', limit=2)  #2개까지만 채워준다

          0         1         2
0  0.402119  0.542518  0.625636
1  0.955001  0.996203 -1.000390
2  0.294564  0.996203 -0.285961
3  1.439301  0.996203  1.316858
4  0.421212       NaN  1.316858
5 -1.427397       NaN  1.316858

In [82]:
data = Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [83]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64